In [1]:
#base
import numpy as np
import pandas as pd
import seaborn as sns
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                     names=['subject', 'type'])

# mock some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37

# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)

#make_df
def make_df(cols, ind):
    """Quickly make a DataFrame"""
    data = {c: [str(c) + str(i) for i in ind]
            for c in cols}
    return pd.DataFrame(data, ind)

class display(object):
    """Display HTML representation of multiple objects"""
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}</p>{1}
    </div>"""
    def __init__(self, *args):
        self.args = args
        
    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_())
                         for a in self.args)
    
    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
                           for a in self.args)

### Pandas Series

##### About Series

Series는 1차원 array이며, ``values``와 ``index`` 라는 속성이 있다.

``values``는 Numpy array이다.

In [19]:
x=pd.Series([1,2,3,4,5], index=['a','b','c','d','e']) #인덱스 지정 가능
x, x.values, x.index

(a    1
 b    2
 c    3
 d    4
 e    5
 dtype: int64,
 array([1, 2, 3, 4, 5], dtype=int64),
 Index(['a', 'b', 'c', 'd', 'e'], dtype='object'))

Numpy array : ``implicitly defined`` integer index

Pandas Series : ``explicitly defined`` index

In [20]:
x['a':'c'] #array-style indexing

a    1
b    2
c    3
dtype: int64

##### Constructing Series

pd.Series(data, index=index)

In [21]:
a=pd.Series([1,2,3], index=['a','b','c'])
a

a    1
b    2
c    3
dtype: int64

Constructing as dictionary

In [22]:
b=pd.Series({'a':1, 'b':2, 'c':3})
b

a    1
b    2
c    3
dtype: int64

In [23]:
c=pd.Series({'a':1, 'b':2, 'c':3, 'd':4}, index=['a','b','c']) #명시적 한정
c

a    1
b    2
c    3
dtype: int64

### Pandas DataFrame

##### About DataFrame

index를 공유하는 ``Series``의 모임이다.

In [3]:
population=pd.Series({'California': 38332521,'Texas': 26448193,'New York': 19651127,'Florida': 19552860, 'Illinois': 12882135})
area=pd.Series({'California': 423967, 'Texas': 695662, 'New York': 141297, 'Florida': 170312, 'Illinois': 149995})

In [6]:
states=pd.DataFrame({'population':population, 'area':area})
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

``index``, ``values``, ``columns``

In [26]:
states.index, states.values, states.columns

(Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object'),
 array([[38332521,   423967],
        [26448193,   695662],
        [19651127,   141297],
        [19552860,   170312],
        [12882135,   149995]], dtype=int64),
 Index(['population', 'area'], dtype='object'))

##### Constructing DataFrame

Single Series

In [27]:
pd.DataFrame(population, columns=['population'])

            population
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135

From a list of dicts

In [28]:
data = [{'a': i, 'b': 2 * i}
        for i in range(3)]
pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4

From a two-dimensional Numpy array

In [29]:
pd.DataFrame(np.random.randint(0,10,(3,3)),
                        index=[1,2,3],
                        columns=['a','b','c'])

   a  b  c
1  4  3  0
2  2  4  6
3  3  5  1

일부 값이 없다면 NaN으로 채워진다.

In [30]:
pd.DataFrame([{'a':1, 'b':2}, {'c':3, 'd':4}])

     a    b    c    d
0  1.0  2.0  NaN  NaN
1  NaN  NaN  3.0  4.0

### Pandas Index

Python의 ``set`` data structure을 따르는 인덱스 array이다. (집합 연산 가능)

한 번 정의하면 수정할 수 없다.

In [31]:
ind=pd.Index([1,2,3,4,5])
ind

Int64Index([1, 2, 3, 4, 5], dtype='int64')

In [32]:
pd.DataFrame(['a','b','c','d','e'], index=ind)

   0
1  a
2  b
3  c
4  d
5  e

### Data Indexing and Selection

Numpy array와 비슷하게 ``Series`` 와 ``DataFrame`` 데이터에 접근한다.

``indexing`` : explicit 우선

``slicing`` : implicit 우선

##### In Series

In [33]:
data=pd.Series([1,2,3,4], ['a','b','c', 'd'])
data

a    1
b    2
c    3
d    4
dtype: int64

In [34]:
data['e']=5 #데이터 추가
print(data['b'], data['e'])
print(list(data.items())) #(키, 값) 튜플

2 5
[('a', 1), ('b', 2), ('c', 3), ('d', 4), ('e', 5)]

In [35]:
print(data[0:2]) #implicit ==iloc
print(data['a':'c']) #explicit, ==loc
print(data[(data>=1) & (data<4)]) #masking
print(data[['a', 'e']]) #fancy indexing

a    1
b    2
dtype: int64
a    1
b    2
c    3
dtype: int64
a    1
b    2
c    3
dtype: int64
a    1
e    5
dtype: int64

##### In DataFrame

In [37]:
data=pd.DataFrame({'area':area, 'pop':population})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [39]:
#각 column을 나타내는 Series로 접근
data['area'] #==data.area (attribute-style)

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [40]:
#새로운 column의 추가
data['density']=data['pop']/data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [41]:
#전치 (Transpose)
data.T

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

``loc``, ``iloc`` 이용이 가능하다.

``loc``과 ``masking`` 및 ``fancy indexing``이 결합될 수 있다.

In [43]:
data.loc[data.density<100, ['area', 'density']] #masking & fancy indexing

              area    density
California  423967  90.413926
Texas       695662  38.018740
Illinois    149995  85.883763

items : each columns

iterrows : each rows

### Ufuncs

##### Index Preservation

연산 이후 Pandas object가 리턴되며 index가 보존된다.

In [47]:
x, np.exp(x)

(a    1
 b    2
 c    3
 d    4
 e    5
 dtype: int64,
 a      2.718282
 b      7.389056
 c     20.085537
 d     54.598150
 e    148.413159
 dtype: float64)

##### Index Alignment

존재하지 않는 값은 ``NaN`` 처리된다.

fill_value 파라미터를 이용해 ``NaN`` 값을 대체할 수 있다.

In [49]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')
population/area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [54]:
X=pd.DataFrame(np.random.randint(0,20,(2,2)))
Y=pd.DataFrame(np.random.randint(0,20,(3,3)))
X+Y

     0     1   2
0  4.0  16.0 NaN
1  7.0   2.0 NaN
2  NaN   NaN NaN

In [56]:
X.add(Y, fill_value=X.stack().mean())
#stack을 이용하여 X의 전체 합계 계산. stack()이 없으면 default로 Series별 평균이 반환됨

      0     1     2
0   4.0  16.0  21.5
1   7.0   2.0  18.5
2  16.5  19.5  14.5

##### Operations between Series & DataFrame

In [59]:
Y

    0   1   2
0   2  12  19
1   5   0  16
2  14  17  12

In [61]:
Y-Y.iloc[0]

    0   1  2
0   0   0  0
1   3 -12 -3
2  12   5 -7

In [69]:
Y.subtract(Y.loc[:,0], axis=0) #column-wise 연산

   0   1   2
0  0  10  17
1  0  -5  11
2  0   3  -2

### Handling Missing Values

#### About Nan & None

Pandas에서는 ``NaN`` 과 ``None``이 사용된다.

``None``이 존재하면 ``sum``, ``min`` 등의 함수를 실행할 수 없지만, 

``NaN``은 부동소수점 소수로서 object에 존재해도 함수 실행이 가능하다. 하지만 결과는 항상 ``NaN``이 된다.

In [70]:
1 + np.nan, 0 * np.nan, np.max([1, np.nan, 2, 3, 4])

(nan, nan, nan)

``NaN``을 배제하는 함수들을 제공한다. ``nansum``, ``nanmin``, ``nanmax``, ...

In [71]:
np.nanmax([1, np.nan, 2, 3, 4])

4.0

#### Operating Null Values

##### Detecting

In [72]:
null=pd.Series([1, np.nan, 'hello', None])

In [73]:
null.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [74]:
null[null.notnull()]

0        1
2    hello
dtype: object

##### Dropping

dropna() : null 삭제

In [75]:
null.dropna()

0        1
2    hello
dtype: object

In [77]:
nulldf=pd.DataFrame([[1,np.nan,2], [2,3,5], [np.nan,4,6]])
nulldf

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [79]:
nulldf.dropna() #DataFrame에서는 행 또는 열 전체가 삭제됨

     0    1  2
1  2.0  3.0  5

In [80]:
nulldf.dropna(axis=1) #axis 지정 가능, default = 0

   2
0  2
1  5
2  6

In [82]:
nulldf[3]=np.nan
nulldf

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [84]:
nulldf.dropna(axis=1, how='all') #모두 NaN인 column 삭제

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [85]:
nulldf.dropna(thresh=3) #NaN이 아닌 값이 3개 미만인 행 삭제

     0    1  2   3
1  2.0  3.0  5 NaN

##### Filling

In [86]:
nulldf

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

fill이 불가능한 경우 NaN이 유지된다.

axis 지정이 가능하다.

In [91]:
nulldf.fillna(method='ffill') #forward-fill

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  2.0  4.0  6 NaN

In [92]:
nulldf.fillna(method='bfill', axis=1) #backward-fill

     0    1    2   3
0  1.0  2.0  2.0 NaN
1  2.0  3.0  5.0 NaN
2  4.0  4.0  6.0 NaN

### Hierarchical Indexing

#### About MultiIndex

MuldiIndex는 여러 level과 label을 가진다.

In [101]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
index=pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [105]:
pop=pd.Series(populations, index=index,)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

계층정 인덱싱을 가진 ``Series``는 ``DataFrame``과 개념적으로 동일하다.

``stack()`` 과 ``unstack()``으로 상호 변환이 가능하다.

In [107]:
pop.unstack()

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

#### MultiIndex Creation

MultiIndex.from_array([arrays])

MultiIndex.from_tuples([tuples])

MultiIndex.from_product([arrays])

In [118]:
df=pd.DataFrame(np.random.randint(0,10,(4,2)),
                        index=[['a','a','b','b'], [1,2,1,2]],
                        columns=['data1', 'data2'])
df #리스트 이용

     data1  data2
a 1      4      7
  2      8      7
b 1      7      3
  2      5      6

In [122]:
data = {('California', 2000): 33871648,
        ('California', 2010): 37253956,
        ('Texas', 2000): 20851820,
        ('Texas', 2010): 25145561,
        ('New York', 2000): 18976457,
        ('New York', 2010): 19378102}
pd.Series(data) #딕셔너리 이용

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

``names`` 속성으로 level에 이름을 붙일 수 있다.

In [126]:
pop.index.names=['state','year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

columns에도 ``MultiIndex``를 적용할 수 있다.

#### Indexing & Slicing

In [127]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [128]:
pop[:, 2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [129]:
pop['California':'New York']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [132]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      36.0  38.7  15.0  37.6  12.0  39.5
     2      44.0  37.5  45.0  38.1  36.0  36.9
2014 1      43.0  37.2  63.0  37.8  15.0  37.0
     2      45.0  37.7  22.0  36.3  45.0  37.3

In [133]:
health_data['Guido', 'HR']

year  visit
2013  1        15.0
      2        45.0
2014  1        63.0
      2        22.0
Name: (Guido, HR), dtype: float64

row 또는 column에서 계층 인덱싱을 할 때에는 tuple을 사용한다.

tuple 내에서의 slicing이 불가능하므로 ``pd.IndexSlice`` object를 이용한다.

In [135]:
health_data.loc[:, ('Bob', 'HR')]

year  visit
2013  1        36.0
      2        44.0
2014  1        43.0
      2        45.0
Name: (Bob, HR), dtype: float64

In [137]:
idx=pd.IndexSlice
health_data.loc[idx[:], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      36.0  15.0  12.0
     2      44.0  45.0  36.0
2014 1      43.0  63.0  15.0
     2      45.0  22.0  45.0

#### Rearranging

MultiIndex slicing 연산들은 index가 정렬되어 있어야 한다.

``sort_index`` 혹은 ``sortlevel`` method를 통해 정렬할 수 있다.

In [138]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [143]:
pop.unstack(level=0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [144]:
pop.unstack(level=1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

``reset_index`` : index → column

In [147]:
pop_flat=pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

``set_index`` : column → index

In [149]:
pop_flat.set_index(['state', 'year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

### Concat & Append

#### About Concat

default로 행우선 결합이며 ``axis`` 로 기준축을 변경할 수 있다.

In [155]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [153]:
df1 = make_df('AB', [1, 2])
df2 = make_df('AB', [3, 4])
display('df1', 'df2', 'pd.concat([df1, df2])')

df1
    A   B
1  A1  B1
2  A2  B2

df2
    A   B
3  A3  B3
4  A4  B4

pd.concat([df1, df2])
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [158]:
display('df1', 'df2', 'pd.concat([df1, df2], axis=1)')

df1
    A   B
1  A1  B1
2  A2  B2

df2
    A   B
3  A3  B3
4  A4  B4

pd.concat([df1, df2], axis=1)
     A    B    A    B
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3  NaN  NaN   A3   B3
4  NaN  NaN   A4   B4

#### Duplicate indices

index가 중복되어도 유지된다.

오류로 처리하고 싶으면 ``verify_integrity``를 True로 설정한다.

중복을 무시하고 싶으면 ``ignore_index``를 True로 설정한다.

``keys``를 설정하면 계층 인덱싱으로 생성된다.

In [165]:
x = make_df('AB', [0, 1])
y = make_df('AB', [2, 3])
y.index = x.index  # make duplicate indices!
display('pd.concat([x, y])', 'pd.concat([x,y], ignore_index=True)', "pd.concat([x,y], keys=['x', 'y'])")

pd.concat([x, y])
    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

pd.concat([x,y], ignore_index=True)
    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

pd.concat([x,y], keys=['x', 'y'])
      A   B
x 0  A0  B0
  1  A1  B1
y 0  A2  B2
  1  A3  B3

In [160]:
display('x', 'y', "")

x
    A   B
0  A0  B0
1  A1  B1

y
    A   B
0  A2  B2
1  A3  B3

pd.concat([x,y], keys=['x', 'y'])
      A   B
x 0  A0  B0
  1  A1  B1
y 0  A2  B2
  1  A3  B3

#### Concatenation

결합 시 column이 일치하지 않으면 join을 통해 결합 방식을 지정한다.

``inner`` : 교집합, ``outer`` : 합집합

In [169]:
df5 = make_df('ABC', [1, 2])
df6 = make_df('BCD', [3, 4])
display('pd.concat([df5, df6])', "pd.concat([df5, df6], join='inner')", "pd.concat([df5, df6], join='outer')")

pd.concat([df5, df6])
     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

pd.concat([df5, df6], join='inner')
    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

pd.concat([df5, df6], join='outer')
     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

### Merge & Join

In [170]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})

#### Categories of Joins

##### one-to-one

In [171]:
df3=pd.merge(df1, df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

##### many-to-one

In [173]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})
display('df3', 'df4', 'pd.merge(df3, df4)')

df3
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

df4
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

pd.merge(df3, df4)
  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

many-to-many

In [174]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
                              'Engineering', 'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 'linux',
                               'spreadsheets', 'organization']})
display('df1', 'df5', "pd.merge(df1, df5)")

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df5
         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

pd.merge(df1, df5)
  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

#### Specification of the Merge Key

##### ``on`` keyword

``on`` keyword를 통해 결합할 key를 지정할수 있다.

In [176]:
display('df1', 'df2', "pd.merge(df1, df2, on='employee')")

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df2
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

pd.merge(df1, df2, on='employee')
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

##### ``left_on`` & ``right_on``

In [177]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})
display('df1', 'df3', 'pd.merge(df1, df3, left_on="employee", right_on="name")')

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df3
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

pd.merge(df1, df3, left_on="employee", right_on="name")
  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

중복 column인 name은 ``drop()`` method를 사용하여 제거할 수 있다.

##### ``left_index`` & ``right_index``

index를 key로 사용하여 결합한다.

``join()`` method 가 같은 기능을 한다. (index 기반 merge)

In [179]:
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
display('df1a', 'df2a',
        "pd.merge(df1a, df2a, left_index=True, right_index=True)", 'df1a.join(df2a)')

df1a
                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

df2a
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

pd.merge(df1a, df2a, left_index=True, right_index=True)
                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

df1a.join(df2a)
                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

index와 column을 혼합하여 key로 사용할 수 있다.

In [180]:
display('df1a', 'df3', "pd.merge(df1a, df3, left_index=True, right_on='name')")

df1a
                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

df3
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

pd.merge(df1a, df3, left_index=True, right_on='name')
         group  name  salary
0   Accounting   Bob   70000
1  Engineering  Jake   80000
2  Engineering  Lisa  120000
3           HR   Sue   90000

##### Specifying Set Arithmetic

In [181]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                    'food': ['fish', 'beans', 'bread']},
                   columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']},
                   columns=['name', 'drink'])

In [182]:
display('df6', 'df7')

df6
    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

df7
     name drink
0    Mary  wine
1  Joseph  beer

In [184]:
display("pd.merge(df6, df7, how='inner')", "pd.merge(df6, df7, how='outer')")

pd.merge(df6, df7, how='inner')
   name   food drink
0  Mary  bread  wine

pd.merge(df6, df7, how='outer')
     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

##### Overlapping Column Names (suffixes)

join 후 column에 중복이 있다면 자동으로 접미어가 붙는다.

suffixes keyword로 접미사를 명시할 수 있다.

In [186]:
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [1, 2, 3, 4]})
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [3, 1, 4, 2]})
display('df8', 'df9')

df8
   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4

df9
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

In [187]:
display('pd.merge(df8, df9, on="name")', 'pd.merge(df8, df9, on="name", suffixes=["_L", "_R"])')

pd.merge(df8, df9, on="name")
   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

pd.merge(df8, df9, on="name", suffixes=["_L", "_R"])
   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

### Aggregation

##### About Simple Aggregation

In [198]:
planets=sns.load_dataset('planets')

count, first, last, mean, median, min, max, std, var, mad, prod, sum

In [194]:
ser=pd.Series(np.random.randint(0,10,5))
df=pd.DataFrame({'A':np.random.randint(0,10,5), 'B':np.random.randint(0,10,5)})
ser

0    7
1    3
2    4
3    2
4    4
dtype: int32

In [193]:
ser.sum(), ser.mean()

(27, 5.4)

``DataFrame``은 default로 column 단위 aggregation 결과가 나온다. (axis argument 이용)

In [195]:
df.mean()

A    5.6
B    5.2
dtype: float64

``describe()`` method로 주요 aggregation 결과를 알 수 있다.

In [197]:
planets.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

##### Groupby

In [204]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data': range(6)}, columns=['key', 'data'])
display('df', "df.groupby('key').sum()")

df
  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

df.groupby('key').sum()
     data
key
A       3
B       5
C       7

In [206]:
planets

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [207]:
planets.groupby('method').count()

                               number  orbital_period  mass  distance  year
method
Astrometry                          2               2     0         2     2
Eclipse Timing Variations           9               9     2         4     9
Imaging                            38              12     0        32    38
Microlensing                       23               7     0        10    23
Orbital Brightness Modulation       3               3     0         2     3
Pulsar Timing                       5               5     0         1     5
Pulsation Timing Variations         1               1     0         0     1
Radial Velocity                   553             553   510       530   553
Transit                           397             397     1       224   397
Transit Timing Variations           4               3     0         3     4

##### Aggregate, filter, transform, apply

aggregate

여러가지 aggregation 작업을 실행하고, 특정 column 별로 적용하고자 하는 operation을 지정할 수 있다.

In [209]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data1': range(6),
                   'data2': np.random.randint(0, 10, 6)},
                   columns = ['key', 'data1', 'data2'])

In [212]:
display('df', "df.groupby('key').aggregate([min, np.median, max])", "df.groupby('key').aggregate({'data1':min, 'data2':max})")

df
  key  data1  data2
0   A      0      5
1   B      1      1
2   C      2      2
3   A      3      9
4   B      4      2
5   C      5      7

df.groupby('key').aggregate([min, np.median, max])
    data1            data2
      min median max   min median max
key
A       0    1.5   3     5    7.0   9
B       1    2.5   4     1    1.5   2
C       2    3.5   5     2    4.5   7

df.groupby('key').aggregate({'data1':min, 'data2':max})
     data1  data2
key
A        0      9
B        1      2
C        2      7

Filtering

조건에 맞지 않는 특정 그룹을 제거한다.

In [214]:
def filter_func(x):
    return x['data2'].std() > 2

display('df', "df.groupby('key').std()", "df.groupby('key').filter(filter_func)")

df
  key  data1  data2
0   A      0      5
1   B      1      1
2   C      2      2
3   A      3      9
4   B      4      2
5   C      5      7

df.groupby('key').std()
       data1     data2
key
A    2.12132  2.828427
B    2.12132  0.707107
C    2.12132  3.535534

df.groupby('key').filter(filter_func)
  key  data1  data2
0   A      0      5
2   C      2      2
3   A      3      9
5   C      5      7

Transformation

그룹별 데이터 변환이 가능하다.

In [215]:
df.groupby('key').transform(lambda x: x - x.mean())

   data1  data2
0   -1.5   -2.0
1   -1.5   -0.5
2   -1.5   -2.5
3    1.5    2.0
4    1.5    0.5
5    1.5    2.5

Apply

임의의 함수를 그룹단위로 적용시킨다.

In [217]:
def norm_by_data2(x):
    # x is a DataFrame of group values
    x['data1'] /= x['data2'].sum()
    return x

display('df', "df.groupby('key').apply(norm_by_data2)")

df
  key  data1  data2
0   A      0      5
1   B      1      1
2   C      2      2
3   A      3      9
4   B      4      2
5   C      5      7

df.groupby('key').apply(norm_by_data2)
  key     data1  data2
0   A  0.000000      5
1   B  0.333333      1
2   C  0.222222      2
3   A  0.214286      9
4   B  1.333333      2
5   C  0.555556      7

##### Specifying the split key

데이터 크기가 같은 Series나 list를 ``key``로 사용할 수 있다.

In [218]:
L = [0, 1, 0, 1, 2, 0]
display('df', 'df.groupby(L).sum()')

df
  key  data1  data2
0   A      0      5
1   B      1      1
2   C      2      2
3   A      3      9
4   B      4      2
5   C      5      7

df.groupby(L).sum()
   data1  data2
0      7     14
1      4     10
2      4      2

index를 group key로 매핑한 dictionary를 사용할 수 있다.

In [219]:
df2 = df.set_index('key')
mapping = {'A': 'vowel', 'B': 'consonant', 'C': 'consonant'}
display('df2', 'df2.groupby(mapping).sum()')

df2
     data1  data2
key
A        0      5
B        1      1
C        2      2
A        3      9
B        4      2
C        5      7

df2.groupby(mapping).sum()
           data1  data2
key
consonant     12     12
vowel          3     14

### Pivot Table

#### About Pivot Table

```python
DataFrame.pivot_table(data, values=None, index=None, columns=None,
                      aggfunc='mean', fill_value=None, margins=False,
                      dropna=True, margins_name='All')
```

In [221]:
titanic=sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [222]:
titanic.pivot_table('survived', index='sex', columns='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

Multi-level pivot table

In [224]:
age , fare = pd.cut(titanic['age'], [0, 18, 80]), pd.qcut(titanic['fare'], 2)
display("titanic.pivot_table('survived', ['sex', age], 'class')", "titanic.pivot_table('survived', ['sex', age], [fare, 'class'])")

titanic.pivot_table('survived', ['sex', age], 'class')
class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 80]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 80]  0.375000  0.071429  0.133663

titanic.pivot_table('survived', ['sex', age], [fare, 'class'])
fare            (-0.001, 14.454]                     (14.454, 512.329]  \
class                      First    Second     Third             First
sex    age
female (0, 18]               NaN  1.000000  0.714286          0.909091
       (18, 80]              NaN  0.880000  0.444444          0.972973
male   (0, 18]               NaN  0.000000  0.260870          0.800000
       (18, 80]              0.0  0.098039  0.125000          0.391304

fare
class              Second     Third
sex    age
female (0, 18]   1.000000  0.318182
       (18, 80]  0.914286  0.391304
male   (0, 18]   0.818182  0.178571
       (18, 80]  0.030303  0.192308

#### Additional options

aggfunc

In [225]:
titanic.pivot_table(index='sex', columns='class',
                    aggfunc={'survived':sum, 'fare':'mean'})

              fare                       survived
class        First     Second      Third    First Second Third
sex
female  106.125798  21.970121  16.118810       91     70    72
male     67.226127  19.741782  12.661633       45     17    47

margins(total)

In [226]:
titanic.pivot_table('survived', index='sex', columns='class', margins=True)

class      First    Second     Third       All
sex
female  0.968085  0.921053  0.500000  0.742038
male    0.368852  0.157407  0.135447  0.188908
All     0.629630  0.472826  0.242363  0.383838

### Strings & Times

#### Strings

In [227]:
data=['peter', 'Paul', None, 'MARY', 'gUIDO']
names=pd.Series(data)

In [228]:
names.str.capitalize()

0    Peter
1     Paul
2     None
3     Mary
4    Guido
dtype: object

``.str.~``

|             |                  |                  |                  |
|-------------|------------------|------------------|------------------|
|``len()``    | ``lower()``      | ``translate()``  | ``islower()``    | 
|``ljust()``  | ``upper()``      | ``startswith()`` | ``isupper()``    | 
|``rjust()``  | ``find()``       | ``endswith()``   | ``isnumeric()``  | 
|``center()`` | ``rfind()``      | ``isalnum()``    | ``isdecimal()``  | 
|``zfill()``  | ``index()``      | ``isalpha()``    | ``split()``      | 
|``strip()``  | ``rindex()``     | ``isdigit()``    | ``rsplit()``     | 
|``rstrip()`` | ``capitalize()`` | ``isspace()``    | ``partition()``  | 
|``lstrip()`` |  ``swapcase()``  |  ``istitle()``   | ``rpartition()`` |

#### Times

##### On Numpy

Numpy 에서 64-bit integer로 표현한 ``datetime64`` dtype을 도입하였다.

이를 이용함으로써 빠른 vectorized operation이 가능하다.

하지만 64비트의 제약으로 표현 가능한 범위가 제한된다.

In [230]:
date=np.array('2015-07-04', dtype='datetime64')
date

array('2015-07-04', dtype='datetime64[D]')

In [231]:
date+np.arange(12)

array(['2015-07-04', '2015-07-05', '2015-07-06', '2015-07-07',
       '2015-07-08', '2015-07-09', '2015-07-10', '2015-07-11',
       '2015-07-12', '2015-07-13', '2015-07-14', '2015-07-15'],
      dtype='datetime64[D]')

Code : 

``Y`` : year, ``M`` : month, ``D`` : day, ``h`` : hour, ``m`` : minute, ``s`` : second

``ms`` : millisecond, ``us`` : microsecond, ``ns`` : nanosecond

##### On Pandas

Pandas 에서는 ``TimeStamp`` object를 제공한다.

``TimeStamp`` 에는 ``DatetimeIndex``를 사용하여 indexing 할 수 있다.

In [232]:
date=pd.to_datetime("4th of July, 2015")
date

Timestamp('2015-07-04 00:00:00')

In [233]:
date.strftime("%A")

'Saturday'

In [234]:
date + pd.to_timedelta(np.arange(12), 'D')

DatetimeIndex(['2015-07-04', '2015-07-05', '2015-07-06', '2015-07-07',
               '2015-07-08', '2015-07-09', '2015-07-10', '2015-07-11',
               '2015-07-12', '2015-07-13', '2015-07-14', '2015-07-15'],
              dtype='datetime64[ns]', freq=None)

Indexing by Time

In [235]:
index = pd.DatetimeIndex(['2014-07-04', '2014-08-04',
                          '2015-07-04', '2015-08-04'])
data = pd.Series([0, 1, 2, 3], index=index)
data

2014-07-04    0
2014-08-04    1
2015-07-04    2
2015-08-04    3
dtype: int64

In [236]:
data['2014':'2015-01-01']

2014-07-04    0
2014-08-04    1
dtype: int64

``Timestamp`` : 시각 (``DataTimeIndex``)

``Period`` : 기간 (``PeriodIndex``)

``Timedelta`` : 시간 (``TimedeltaIndex``)

시간에 관한 range : ``pd.data_range()``

periods : 갯수, freq : 종류(년, 월, 일, 시, 분, 초, ...)

In [237]:
pd.date_range('2015-07-03', '2015-07-10')

DatetimeIndex(['2015-07-03', '2015-07-04', '2015-07-05', '2015-07-06',
               '2015-07-07', '2015-07-08', '2015-07-09', '2015-07-10'],
              dtype='datetime64[ns]', freq='D')

In [239]:
pd.date_range('2015-07-03', periods=8, freq='H')

DatetimeIndex(['2015-07-03 00:00:00', '2015-07-03 01:00:00',
               '2015-07-03 02:00:00', '2015-07-03 03:00:00',
               '2015-07-03 04:00:00', '2015-07-03 05:00:00',
               '2015-07-03 06:00:00', '2015-07-03 07:00:00'],
              dtype='datetime64[ns]', freq='H')

### Eval

##### eval

string expression을 ``eval()`` function에 전달해서 효율적으로 처리한다.

Series와 DataFrame 모두에 적용이 가능하다.

In [259]:
df = pd.DataFrame(np.random.rand(5, 3), columns=['A', 'B', 'C'])
df

          A         B         C
0  0.585797  0.442029  0.294467
1  0.018125  0.883932  0.996166
2  0.902407  0.469655  0.110615
3  0.164551  0.830425  0.604082
4  0.143821  0.737068  0.838904

In [244]:
pd.eval("(df.A + df.B) / (df.C - 1)")

0   -0.711936
1   -1.100916
2   -9.936102
3   -8.846775
4   -1.026566
dtype: float64

다음과 같이 축약이 가능하다.

In [248]:
df.eval('(A+B)/(C-1)')

0   -0.711936
1   -1.100916
2   -9.936102
3   -8.846775
4   -1.026566
dtype: float64

새로운 column으로의 assignment도 가능하다.

In [249]:
df.eval('D=(A+B)/C', inplace=True)
df

          A         B         C         D
0  0.138158  0.241684  0.466467  0.814296
1  0.113335  0.800164  0.170238  5.366012
2  0.750750  0.294618  0.894791  1.168282
3  0.935683  0.643085  0.821543  1.921710
4  0.320413  0.231614  0.462259  1.194195

``@`` 문자를 사용하여 지역 변수 접근이 가능하다. ``pandas.eval()`` 에서는 불가능하다.

In [258]:
temp=5
df=df.eval('A+@temp')
df

0    5.057383
1    5.268116
2    5.933915
3    5.511409
4    5.348305
dtype: float64

##### query

필터링을 한다.

In [261]:
result1=df[(df.A < 0.5) & (df.B > 0.5)]
result2=df.query('A < 0.5 and B > 0.5')
display('result1', 'result2')

result1
          A         B         C
1  0.018125  0.883932  0.996166
3  0.164551  0.830425  0.604082
4  0.143821  0.737068  0.838904

result2
          A         B         C
1  0.018125  0.883932  0.996166
3  0.164551  0.830425  0.604082
4  0.143821  0.737068  0.838904

마찬가지로 ``@`` 문자를 이용하여 지역 변수에 접근할 수 있다.